#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.onepassword_item.rabbit_01_psp_token: Reading...
data.external.rabbit_01_psp_token_otp: Reading...
random_password.rtmp_password: Refreshing state... [id=none]
tls_private_key.webserver_key: Refreshing state... [id=81d28d3c476734c1aaf4c71b34dcb2860024d06e]
random_password.webserver_password: Refreshing state... [id=none]
tls_private_key.rtmp_key: Refreshing state... [id=dd53b14179e8a4c84f7cad1fa6972b0b89075bec]
local_file.webserver_key_file: Refreshing state... [id=75b14ce05c6a838c5d7461fdb112b503bb8e9dc6]
local_file.rtmp_key_file: Refreshing state... [id=34994146c8d028ca24774dd81d754c8a915cab89]
data.onepassword_item.rabbit_01_psp_token: Read complete after 0s [id=vaults/66qfxcmgwlhutunx6slav6fyve/items/h7fhsftvpum7r4b3rnqznz4lym]
data.external.rabbit_01_psp_token_otp: Read complete after 0s [id=-]
proxmox_virtual_environment_file.cloud_config_rtmp: Refreshing state... [id=local:snippets/ubuntu-rtmp.cloud-config.yaml]
proxmox_virtual_environment_file.cloud_config: Refreshing state... [id=local:snippets/ubuntu.cloud-config.yaml]
proxmox_virtual_environment_file.ubuntu2204_cloud_image: Refreshing state... [id=local:iso/jammy-server-cloudimg-amd64.img]
proxmox_virtual_environment_file.ubuntu2004_cloud_image: Refreshing state... [id=local:iso/focal-server-cloudimg-amd64.img]
proxmox_virtual_environment_file.debian_cloud_image: Refreshing state... [id=local:iso/debian-11-genericcloud-amd64.img]
proxmox_virtual_environment_vm.rtmp[0]: Refreshing state... [id=601]
proxmox_virtual_environment_vm.webserver[0]: Refreshing state... [id=501]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # local_file.rtmp_key_file will be created
  + resource "local_file" "rtmp_key_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "600"
      + filename             = "./rtmp-ssh.key"
      + id                   = (known after apply)
    }

  # local_file.webserver_key_file will be created
  + resource "local_file" "webserver_key_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "600"
      + filename             = "./webserver-ssh.key"
      + id                   = (known after apply)
    }

  # proxmox_virtual_environment_vm.rtmp[0] will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "rtmp" {
        id                      = "601"
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
            ],
          - [
              - "10.10.20.20",
            ],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [
              - "fe80::60f1:59ff:fe86:4ecc",
            ],
        ] -> (known after apply)
        name                    = "rtmp1.ddlns.net"
      ~ network_interface_names = [
          - "lo",
          - "eth0",
        ] -> (known after apply)
      ~ tags                    = [
            "automation",
          - "rtmp1",
            "ubuntu",
          + "rtmp1",
        ]
        # (18 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.webserver[0] will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "webserver" {
        id                      = "501"
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
            ],
          - [
              - "10.10.20.129",
            ],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [
              - "fe80::d823:cff:fec5:9eb5",
            ],
        ] -> (known after apply)
        name                    = "web1.ddlns.net"
      ~ network_interface_names = [
          - "lo",
          - "eth0",
        ] -> (known after apply)
        tags                    = [
            "automation",
            "ubuntu",
            "web1",
        ]
        # (18 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.webserver[1] will be created
  + resource "proxmox_virtual_environment_vm" "webserver" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Web2 Server"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + name                    = "web2.ddlns.net"
      + network_interface_names = (known after apply)
      + node_name               = "rabbit-01-psp"
      + on_boot                 = true
      + reboot                  = false
      + started                 = true
      + tablet_device           = true
      + tags                    = [
          + "automation",
          + "ubuntu",
          + "web2",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 502

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + architecture = "x86_64"
          + cores        = 4
          + hotplugged   = 0
          + sockets      = 1
          + type         = "qemu64"
          + units        = 1024
        }

      + disk {
          + datastore_id = "data-ssd"
          + file_format  = "qcow2"
          + file_id      = "local:iso/jammy-server-cloudimg-amd64.img"
          + interface    = "virtio0"
          + iothread     = true
          + size         = 10
          + ssd          = false
        }
      + disk {
          + datastore_id = "data-ssd"
          + file_format  = "qcow2"
          + interface    = "virtio1"
          + iothread     = true
          + size         = 30
          + ssd          = false
        }

      + initialization {
          + datastore_id      = "data-ssd"
          + user_data_file_id = "local:snippets/ubuntu.cloud-config.yaml"

          + ip_config {
              + ipv4 {
                  + address = "dhcp"
                }
            }

          + user_account {
              + keys     = [
                  + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDs7cUrDeSpk6gIsqD2gJUFu/fzvqi3a3Ymv3ICqz26k7uhPuV0acp2dl914lRUjw05fpW2MOPVSlQ21kCLCUzCtD+TvG62DbhPg15Zl0xWKmI9vih+zyxDIqh1dRljv8zOBgD2HOcLXT3N5KsqLRVXb2bS/85KRDq4PFxqdLGH4PtAr/tG9q/92Hi8USDS6qAj7OYspDgsel3qknMxBI/DPU7TZfFQjjWJRRem992M3s1JVh3Dww0HIXD6P8hozmAV1Bn4ZdXFYbG8S9fGlWnvRLfh7SLbSxBFBWHoGJkIC5DFZbEeji/8sPBp+n6+a9PgXfugyGKia/AjqyD5Mea9",
                ]
              + password = (sensitive value)
              + username = "ubuntu"
            }
        }

      + memory {
          + dedicated = 4096
          + floating  = 0
          + shared    = 0
        }

      + network_device {
          + bridge     = "vmbr1"
          + enabled    = true
          + model      = "virtio"
          + mtu        = 0
          + rate_limit = 0
          + vlan_id    = 0
        }

      + operating_system {
          + type = "l26"
        }

      + serial_device {
          + device = "socket"
        }
    }

Plan: 3 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ rtmp_ip               = [
      - "10.10.20.20",
    ] -> (known after apply)
  ~ webserver_ip          = [
      - "10.10.20.129",
    ] -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @dark-vex, Action: `pull_request`, Working Directory: ``, Workflow: `TF Plan on a PR (PSP)`*